## Pandas Tutorial

In [1]:
import pandas as pd

In [45]:
data = {
    "name": ["Aman", "Alice", "Sanat", "Nhuja", "Anita", "Kripa"],
    "age": [20, 21, 21, 20, 22, 22],
    "address": ["bkt", "ktm", "patan", "banepa", "usa", "aus"]
}

data

{'name': ['Aman', 'Alice', 'Sanat', 'Nhuja', 'Anita', 'Kripa'],
 'age': [20, 21, 21, 20, 22, 22],
 'address': ['bkt', 'ktm', 'patan', 'banepa', 'usa', 'aus']}

In [46]:
df = pd.DataFrame(data)

df

    name  age address
0   Aman   20     bkt
1  Alice   21     ktm
2  Sanat   21   patan
3  Nhuja   20  banepa
4  Anita   22     usa
5  Kripa   22     aus

In [47]:
df.head()

    name  age address
0   Aman   20     bkt
1  Alice   21     ktm
2  Sanat   21   patan
3  Nhuja   20  banepa
4  Anita   22     usa

In [48]:
df.tail()

    name  age address
1  Alice   21     ktm
2  Sanat   21   patan
3  Nhuja   20  banepa
4  Anita   22     usa
5  Kripa   22     aus

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [50]:
df.describe()

             age
count   6.000000
mean   21.000000
std     0.894427
min    20.000000
25%    20.250000
50%    21.000000
75%    21.750000
max    22.000000

In [51]:
names = df["name"]
names

0     Aman
1    Alice
2    Sanat
3    Nhuja
4    Anita
5    Kripa
Name: name, dtype: object

In [52]:
type(names)

pandas.core.series.Series

In [53]:
df_new = df[["name", "age"]]
df_new

    name  age
0   Aman   20
1  Alice   21
2  Sanat   21
3  Nhuja   20
4  Anita   22
5  Kripa   22

In [54]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [55]:
df["age"] + 5

0    25
1    26
2    26
3    25
4    27
5    27
Name: age, dtype: int64

In [56]:
df["age"] >= 21

0    False
1     True
2     True
3    False
4     True
5     True
Name: age, dtype: bool

In [57]:
df[df["age"] >= 21]

    name  age address
1  Alice   21     ktm
2  Sanat   21   patan
4  Anita   22     usa
5  Kripa   22     aus

In [58]:
df.loc[df["age"] >= 21, ["name","age"]]

    name  age
1  Alice   21
2  Sanat   21
4  Anita   22
5  Kripa   22

In [59]:
df.iloc[0:3, 0:2]

    name  age
0   Aman   20
1  Alice   21
2  Sanat   21

In [60]:
df["age"].min()

np.int64(20)

In [61]:
df["age"].max()

np.int64(22)

In [62]:
df["age"].std()

np.float64(0.8944271909999159)

In [63]:
df["age"].mean()

np.float64(21.0)